doc/html/handlers/session.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Session Handler</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Session Handler"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-10-18 03:24:11 CDT"/>
<meta name="author" content="Jesse Gumm (@jessegumm)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<LINK href="../stylesheet.css" rel="stylesheet" type="text/css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Session Handler</h1>

<p><a href="../index.html">Getting Started</a> | <a href="../api.html">API</a> | <a href="../elements.html">Elements</a> | <a href="../actions.html">Actions</a> | <a href="../validators.html">Validators</a> | <a href="../handlers.html"><b>Handlers</b></a> | <a href="../config.html">Configuration Options</a> | <a href="../about.html">About</a>
</p>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Session Handler</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Session Handler</h2>
<div class="outline-text-2" id="text-1">


<p>
The session handler controls how session information and variables are set,
stored, and retrieved. The default configuration uses the process registry
to share session state between nodes, and uses a cookie to identify the user
with the associated session.
</p>

</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3"></span> Behavior Functions</h3>
<div class="outline-text-3" id="text-1-1">



</div>

<div id="outline-container-1-1-1" class="outline-5">
<h5 id="sec-1-1-1"><span class="section-number-5"></span> <code>init(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-1">


<p>
  Initialize the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-5">
<h5 id="sec-1-1-2"><span class="section-number-5"></span> <code>finish(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-2">


<p>
  Clean up the handler
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-3" class="outline-5">
<h5 id="sec-1-1-3"><span class="section-number-5"></span> <code>get_value(Key, DefaultValue, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-3">


<p>
Retrieves the value of session variable associated with <code>Key</code>  
</p>
<ul>
<li><code>Key</code> - The key to retrieve

</li>
<li><code>DefaultValue</code> - If there is no value set for <code>Key</code>, then return this value

</li>
<li><i>Return Value</i> - <code>{ok, Value, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-4" class="outline-5">
<h5 id="sec-1-1-4"><span class="section-number-5"></span> <code>set_value(Key, Value, Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-4">


<p>
Store the value of <code>Value</code> as a session variable with the <code>Key</code> as the
identifier.  If a value already exists, it's overwritten and the original
value is returned.
</p>
<ul>
<li><code>Key</code> - The key to store, any erlang term

</li>
<li><code>Value</code> - The value to store as Key

</li>
<li><i>Return Value</i> - <code>{ok, OldValue, NewState}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-5" class="outline-5">
<h5 id="sec-1-1-5"><span class="section-number-5"></span> <code>clear_all(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-5">


<p>
Wipe out this session and all associated session variables
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, Newstate}</code>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-1-6" class="outline-5">
<h5 id="sec-1-1-6"><span class="section-number-5"></span> <code>session_id(Config, State)</code></h5>
<div class="outline-text-5" id="text-1-1-6">


<p>
Return the unique session identifier.
</p>
<ul>
<li><i>Return Value</i> - <code>{ok, SessionId, NewState}</code>
</li>
</ul>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3"></span> Example</h3>
<div class="outline-text-3" id="text-1-2">


<p>
Here is the complete text of the default session handler
</p>



<pre class="src src-erlang"><span class="org-preprocessor">-module</span> (simple_session_handler).
<span class="org-preprocessor">-include_lib</span> (<span class="org-string">"wf.hrl"</span>).
<span class="org-preprocessor">-behaviour</span> (session_handler).
<span class="org-preprocessor">-export</span> ([
    <span class="org-type">init/2</span>,
    <span class="org-type">finish/2</span>,
    <span class="org-type">get_value/4</span>,
    <span class="org-type">set_value/4</span>,
    <span class="org-type">clear_all/2</span>,
    <span class="org-type">session_id/2</span>
]).
<span class="org-preprocessor">-record</span> (<span class="org-type">state</span>, {unique, node}).

<span class="org-function-name">init</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">_State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Get the session cookie and node...</span>
    <span class="org-variable-name">Cookie</span> = <span class="org-type">wf</span>:<span class="org-type">cookie</span>(<span class="org-type">get_cookie_name</span>()),
    <span class="org-variable-name">State</span> = <span class="org-keyword">case</span> <span class="org-type">wf</span>:<span class="org-type">depickle</span>(<span class="org-variable-name">Cookie</span>) <span class="org-keyword">of</span>
        undefined -&gt;<span class="org-function-name"> </span><span class="org-type">new_state</span>();
        <span class="org-variable-name">Other</span> -&gt;<span class="org-function-name"> </span><span class="org-variable-name">Other</span>
    <span class="org-keyword">end</span>,
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">finish</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-comment-delimiter">% </span><span class="org-comment">Drop the session cookie...</span>
    <span class="org-variable-name">Timeout</span> = <span class="org-type">wf</span>:<span class="org-type">config_default</span>(session_timeout, 20),
    ok = <span class="org-type">wf</span>:<span class="org-type">cookie</span>(<span class="org-type">get_cookie_name</span>(), <span class="org-type">wf</span>:<span class="org-type">pickle</span>(<span class="org-variable-name">State</span>), <span class="org-string">"/"</span>, <span class="org-variable-name">Timeout</span>),
    {ok, []}.

<span class="org-function-name">get_value</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">DefaultValue</span>, <span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">Pid</span>} = <span class="org-type">get_session_pid</span>(<span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>),
    <span class="org-variable-name">Ref</span> = <span class="org-builtin">make_ref</span>(),
    <span class="org-variable-name">Pid</span>!{get_value, <span class="org-variable-name">Key</span>, <span class="org-builtin">self</span>(), <span class="org-variable-name">Ref</span>},
    <span class="org-variable-name">Value</span> = <span class="org-keyword">receive</span>
        {ok, undefined, <span class="org-variable-name">Ref</span>} -&gt;<span class="org-function-name"> </span><span class="org-variable-name">DefaultValue</span>;
        {ok, <span class="org-variable-name">Other</span>, <span class="org-variable-name">Ref</span>} -&gt;<span class="org-function-name"> </span><span class="org-variable-name">Other</span>
    <span class="org-keyword">end</span>,
    {ok, <span class="org-variable-name">Value</span>, <span class="org-variable-name">State</span>}.

<span class="org-function-name">set_value</span>(<span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span>, <span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">Pid</span>} = <span class="org-type">get_session_pid</span>(<span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>),
    <span class="org-variable-name">Ref</span> = <span class="org-builtin">make_ref</span>(),
    <span class="org-variable-name">Pid</span>!{set_value, <span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span>, <span class="org-builtin">self</span>(), <span class="org-variable-name">Ref</span>},
    <span class="org-keyword">receive</span> {ok, <span class="org-variable-name">OldValue</span>, <span class="org-variable-name">Ref</span>} -&gt;<span class="org-function-name"> </span>ok <span class="org-keyword">end</span>,
    {ok, <span class="org-variable-name">OldValue</span>, <span class="org-variable-name">State</span>}.

<span class="org-function-name">clear_all</span>(<span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">Pid</span>} = <span class="org-type">get_session_pid</span>(<span class="org-variable-name">Config</span>, <span class="org-variable-name">State</span>),
    <span class="org-variable-name">Ref</span> = <span class="org-builtin">make_ref</span>(),
    <span class="org-variable-name">Pid</span>!{clear_all, <span class="org-builtin">self</span>(), <span class="org-variable-name">Ref</span>},
    <span class="org-keyword">receive</span> {ok, <span class="org-variable-name">Ref</span>} -&gt;<span class="org-function-name"> </span>ok <span class="org-keyword">end</span>,
    {ok, <span class="org-variable-name">State</span>}.

<span class="org-function-name">session_id</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    {ok, <span class="org-variable-name">SessionId</span>} = <span class="org-type">wf</span>:<span class="org-type">hex_encode</span> (<span class="org-variable-name">State</span>#<span class="org-type">state</span>.unique),
    {ok, <span class="org-variable-name">SessionId</span>, <span class="org-variable-name">State</span>}.

<span class="org-comment-delimiter">%%% </span><span class="org-comment">PRIVATE FUNCTIONS</span>

<span class="org-function-name">get_cookie_name</span>() -&gt;
    <span class="org-type">wf</span>:<span class="org-type">config_default</span>(cookie_name, <span class="org-string">"newcookie"</span>).

<span class="org-function-name">get_session_pid</span>(<span class="org-variable-name">_Config</span>, <span class="org-variable-name">State</span>) -&gt;
    <span class="org-variable-name">Timeout</span> = <span class="org-type">wf</span>:<span class="org-type">config_default</span>(session_timeout, 20),
    <span class="org-variable-name">F</span> = <span class="org-keyword">fun</span>() -&gt;<span class="org-function-name"> </span><span class="org-type">session_loop</span>([], <span class="org-variable-name">Timeout</span>) <span class="org-keyword">end</span>,
    <span class="org-variable-name">SessionTag</span> = {session, <span class="org-variable-name">State</span>#<span class="org-type">state</span>.unique},
    {ok, <span class="org-variable-name">_Pid</span>} = <span class="org-type">process_registry_handler</span>:<span class="org-type">get_pid</span>(<span class="org-variable-name">SessionTag</span>, <span class="org-variable-name">F</span>).

<span class="org-function-name">session_loop</span>(<span class="org-variable-name">Session</span>, <span class="org-variable-name">Timeout</span>) -&gt;
    <span class="org-comment-delimiter">%% </span><span class="org-comment">Timeout in 10 if the session is empty...</span>
    <span class="org-variable-name">TimeoutMS</span> = <span class="org-keyword">case</span> <span class="org-variable-name">Session</span> == [] <span class="org-keyword">of</span>
        true  -&gt;<span class="org-function-name"> </span>10 * 1000;
        false -&gt;<span class="org-function-name"> </span><span class="org-variable-name">Timeout</span> * 60 * 1000
    <span class="org-keyword">end</span>,
    <span class="org-keyword">receive</span>
        {get_value, <span class="org-variable-name">Key</span>, <span class="org-variable-name">Pid</span>, <span class="org-variable-name">Ref</span>} -&gt;
            <span class="org-variable-name">Value</span> = <span class="org-keyword">case</span> <span class="org-type">lists</span>:<span class="org-type">keysearch</span>(<span class="org-variable-name">Key</span>, 1, <span class="org-variable-name">Session</span>) <span class="org-keyword">of</span>
                {value, {<span class="org-variable-name">Key</span>, <span class="org-variable-name">V</span>}} -&gt;<span class="org-function-name"> </span><span class="org-variable-name">V</span>;
                false -&gt;<span class="org-function-name"> </span>undefined
            <span class="org-keyword">end</span>,
            <span class="org-variable-name">Pid</span>!{ok, <span class="org-variable-name">Value</span>, <span class="org-variable-name">Ref</span>},
            <span class="org-type">session_loop</span>(<span class="org-variable-name">Session</span>, <span class="org-variable-name">Timeout</span>);

        {set_value, <span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span>, <span class="org-variable-name">Pid</span>, <span class="org-variable-name">Ref</span>} -&gt;
            <span class="org-variable-name">OldValue</span> = <span class="org-keyword">case</span> <span class="org-type">lists</span>:<span class="org-type">keysearch</span>(<span class="org-variable-name">Key</span>, 1, <span class="org-variable-name">Session</span>) <span class="org-keyword">of</span>
                {value, {<span class="org-variable-name">Key</span>, <span class="org-variable-name">V</span>}} -&gt;<span class="org-function-name"> </span><span class="org-variable-name">V</span>;
                false -&gt;<span class="org-function-name"> </span>undefined
            <span class="org-keyword">end</span>,
            <span class="org-variable-name">Session1</span> = <span class="org-type">lists</span>:<span class="org-type">keystore</span>(<span class="org-variable-name">Key</span>, 1, <span class="org-variable-name">Session</span>, {<span class="org-variable-name">Key</span>, <span class="org-variable-name">Value</span>}),
            <span class="org-variable-name">Pid</span>!{ok, <span class="org-variable-name">OldValue</span>, <span class="org-variable-name">Ref</span>},
            <span class="org-type">session_loop</span>(<span class="org-variable-name">Session1</span>, <span class="org-variable-name">Timeout</span>);

        {clear_all, <span class="org-variable-name">Pid</span>, <span class="org-variable-name">Ref</span>} -&gt;
            <span class="org-variable-name">Pid</span>!{ok, <span class="org-variable-name">Ref</span>},
            <span class="org-type">session_loop</span>([], <span class="org-variable-name">Timeout</span>)

    <span class="org-keyword">after</span> <span class="org-variable-name">TimeoutMS</span> -&gt;
        <span class="org-builtin">exit</span>(timed_out)
    <span class="org-keyword">end</span>.

<span class="org-function-name">new_state</span>() -&gt;
    <span class="org-variable-name">Unique</span> = <span class="org-builtin">erlang</span>:<span class="org-builtin">md5</span>(<span class="org-builtin">term_to_binary</span>({<span class="org-builtin">now</span>(), <span class="org-builtin">erlang</span>:<span class="org-builtin">make_ref</span>()})),
    #<span class="org-type">state</span> { unique=<span class="org-variable-name">Unique</span> }.

</pre>



</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3"></span> See Also</h3>
<div class="outline-text-3" id="text-1-3">


<ul>
<li><a href="../handlers.html">Handler Overview</a>

</li>
<li><a href="../api.html#sec-7">API: Session</a>
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-10-18 03:24:11 CDT</p>
<p class="author">Author: Jesse Gumm (@jessegumm)</p>
<p class="creator">Org version 7.8.02 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div><h2>Comments</h2>
<b>Note:</b><!-- Disqus does not currently support Erlang for its syntax highlighting, so t-->To specify <!--Erlang--> code blocks, just use the generic code block syntax: <pre><b>&lt;pre&gt;&lt;code&gt;your code here&lt;/code&gt;&lt;/pre&gt;</b></pre>
<br />
<br />
<div id="disqus_thread"></div>
<script type="text/javascript">
	/* * * CONFIGURATION VARIABLES: EDIT BEFORE PASTING INTO YOUR WEBPAGE * * */
	var disqus_shortname = 'nitrogenproject'; // required: replace example with your forum shortname
	var disqus_identifier = 'html/handlers/session.html'; //This will be replaced with the path part of the url

	/* * * DON'T EDIT BELOW THIS LINE * * */
	(function() {
		var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
		dsq.src = 'http://' + disqus_shortname + '.disqus.com/embed.js';
		(document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
	})();
</script>
<noscript>Please enable JavaScript to view the <a href="http://disqus.com/?ref_noscript">comments powered by Disqus.</a></noscript>
<a href="http://disqus.com" class="dsq-brlink">comments powered by <span class="logo-disqus">Disqus</span></a>
</body>
</html>
